{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,28,28],"dtype":"float32","sparse":false,"name":"flatten_input"}},{"class_name":"Flatten","config":{"data_format":"channels_last","name":"flatten","trainable":true,"batch_input_shape":[null,28,28],"dtype":"float32"}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_1","trainable":true}}]},"keras_version":"tfjs-layers 3.7.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.7.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense/kernel","shape":[784,128],"dtype":"float32"},{"name":"dense/bias","shape":[128],"dtype":"float32"},{"name":"dense_1/kernel","shape":[128,10],"dtype":"float32"},{"name":"dense_1/bias","shape":[10],"dtype":"float32"}]}]}